#+title: Formally Specifying the Rust Core
#+author: Aniket Mishra
#+email: aniket.mishra@iitgn.ac.in

** SIMD in Rust
   The core::arch crate (the Rust equivalent of a C library) is responsible for exposing these vendor-specific intrinsics that typically correspond to a single machine instruction.
   #+begin_src rust
   /// Simple program squares elements in 16 bit chunks.
   use core::arch::x86_64::*;
   fn main() {
       unsafe {
   	let a : __m256i = _mm256_set_epi16
   	    (0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15);
           let b : __m256i = _mm256_mullo_epi16(a, a);
   	println!("{}",_mm256_extract_epi16::<0>(b));
   	println!("{}",_mm256_extract_epi16::<15>(b));
       }
   }
   #+end_src
   #+RESULTS:
   : 225
   : 0
   
